{
  "table": {
    "uid": "03ef04b2-1710-4176-81b9-350134a9b49f",
    "table": [
      [
        "",
        "As of December 31,",
        ""
      ],
      [
        "",
        "2018",
        "2019"
      ],
      [
        "Derivative liabilities carried at fair value through profit or loss (FVTPL)",
        "",
        ""
      ],
      [
        "Interest rate swaps",
        "9,196",
        "49,891"
      ],
      [
        "Forward foreign exchange contracts",
        "1,467",
        "41"
      ],
      [
        "Derivative liabilities designated and effective as hedging instruments carried at fair value",
        "",
        ""
      ],
      [
        "Cross currency swaps",
        "1,429",
        "—"
      ],
      [
        "Total",
        "12,092",
        "49,932"
      ],
      [
        "Derivative financial instruments, current liability",
        "2,091",
        "8,095"
      ],
      [
        "Derivative financial instruments, non-current liability",
        "10,001",
        "41,837"
      ],
      [
        "Total",
        "12,092",
        "49,932"
      ]
    ]
  },
  "context": "GasLog Ltd. and its Subsidiaries\nNotes to the consolidated financial statements (Continued)\nFor the years ended December 31, 2017, 2018 and 2019\n(All amounts expressed in thousands of U.S. Dollars, except share and per share data) 26. Derivative Financial Instruments (Continued) The fair value of the derivative liabilities is as follows: Interest rate swap agreements The Group enters into interest rate swap agreements which convert the floating interest rate exposure into a fixed interest rate in order to hedge a portion of the Group’s exposure to fluctuations in prevailing market interest rates. Under the interest rate swaps, the bank counterparty effects quarterly floating-rate payments to the Group for the notional amount based on the U.S. dollar LIBOR, and the Group effects quarterly payments to the bank on the notional amount at the respective fixed rates. Interest rate swaps designated as cash flow hedging instruments As of December 31, 2018 and 2019, there are no interest rate swaps designated as cash flow hedging instruments for accounting purposes.",
  "image_cues": "",
  "user_profile": "general",
  "questions": [
    "In which years was the fair value of the derivative liabilities recorded for?",
    "What was the fair value of cross currency swaps in 2018?",
    "What was the fair value of derivatives non-current liability in 2019?",
    "In which year was the fair value of forward foreign exchange contracts higher?",
    "What was the change in fair value of interest rate swaps from 2018 to 2019?",
    " What was the percentage change in total fair value of the derivative liabilities from 2018 to 2019?"
  ],
  "answer_scales": [
    "",
    "thousand",
    "thousand",
    "",
    "thousand",
    "percent"
  ],
  "answer_types": [
    "multi-span",
    "span",
    "span",
    "span",
    "arithmetic",
    "arithmetic"
  ]
}
