{
  "table": {
    "uid": "1aef0c1f-6ded-4d8e-bb9c-4c0fe62e9ab6",
    "table": [
      [
        "",
        "",
        "Fiscal Years",
        ""
      ],
      [
        "",
        "2019",
        "2018",
        "2017"
      ],
      [
        "Cost of revenue",
        "$2,936",
        "$3,869",
        "$3,189"
      ],
      [
        "Research and development",
        "8,551",
        "13,448",
        "10,565"
      ],
      [
        "Selling, general and administrative",
        "12,305",
        "14,620",
        "22,581"
      ],
      [
        "Total",
        "$23,792",
        "$31,937",
        "$36,335"
      ]
    ]
  },
  "context": "Share-Based Compensation The following table shows a summary of share-based compensation expense included in the Consolidated Statements of Operations during the periods presented (in thousands): Amounts presented above include share-based compensation expense of $0.8 million for fiscal year 2017, which is recorded as discontinued operations related to employees of our Compute business. As of September 27, 2019, the total unrecognized compensation costs related to outstanding stock options, restricted stock awards and units including awards with time-based, performance-based, and market-based vesting was $47.0 million, which we expect to recognize over a weighted-average period of 2.9 years.",
  "image_cues": "",
  "user_profile": "general",
  "questions": {
    "862a5386-ce39-493c-acf9-ded6177ba4b5": "What was the share based compensation expense in 2017?",
    "dc309911-b982-4bd9-a5d2-4b39699666d4": "Over what period would the expense be recognized?",
    "0aa35355-b486-4156-935e-9c73d70e47f8": "What was the respective cost of revenue in 2019, 2018 and 2017?",
    "d3be0784-57f7-4545-bc48-6928d7a5e778": "In which year was Research and development less than 10,000 thousands?",
    "36c5a475-701d-4115-a479-cee5ea42f947": "What was the average cost of revenue for 2017-2019?",
    "c36d505f-cdc1-43c2-891f-d83cb7499d0d": "What is the change in the Selling, general and administrative expense from 2018 to 2019?"
  }
}