{
  "table": {
    "uid": "1cacb8a3-8587-4ff4-aadb-814352f5c0ff",
    "table": [
      [
        "",
        "2019",
        "2018"
      ],
      [
        "",
        "€m",
        "€m"
      ],
      [
        "Amounts falling due within one year:",
        "",
        ""
      ],
      [
        "Amounts owed by subsidiaries1",
        "242,976",
        "220,871"
      ],
      [
        "Taxation recoverable",
        "233",
        "–"
      ],
      [
        "Other debtors",
        "32",
        "199"
      ],
      [
        "Derivative financial instruments",
        "183",
        "163"
      ],
      [
        "",
        "243,424",
        "221,233"
      ],
      [
        "Amounts falling due after more than one year:",
        "",
        ""
      ],
      [
        "Derivative financial instruments",
        "3,439",
        "2,449"
      ],
      [
        "Deferred tax",
        "–",
        "31"
      ],
      [
        "",
        "3,439",
        "2,480"
      ]
    ]
  },
  "context": "3. Debtors Accounting policies Amounts owed to subsidiaries are classified and recorded at amortised cost (2018: classified as loans and receivables) and reduced by allowances for expected credit losses. Estimate future credit losses are first recorded on initial recognition of a receivable and are based on estimated probability of default. Individual balances are written off when management deems them not to be collectible. Derivative financial instruments are measured at fair value through profit and loss. Note: 1 Amounts owed by subsidiaries are unsecured, have no fixed date of repayment and are repayable on demand with sufficient liquidity in the group to flow funds if required. Therefore expected credit losses are considered to be immateria",
  "image_cues": "",
  "user_profile": "general",
  "questions": [
    "What financial items does amounts falling due within one year consist of?",
    "What financial items does amounts falling due after more than one year consist of?",
    "What is the 2019 taxation recoverable falling due within one year ?",
    "What is the 2019 average total amount falling due within one year?",
    "What is the 2019 average total amount falling due after more than one year?",
    "Between 2018 and 2019, which year has higher amounts owed by subsidiaries falling due within one year?"
  ],
  "answer_scales": [
    "",
    "",
    "million",
    "million",
    "million",
    ""
  ],
  "answer_types": [
    "multi-span",
    "multi-span",
    "span",
    "arithmetic",
    "arithmetic",
    "span"
  ]
}
