{
  "table": {
    "uid": "285a1ced-709e-4f45-a227-b6cd04e725f9",
    "table": [
      [
        "",
        "2019 (1)",
        "2018",
        "2017 (2)"
      ],
      [
        "Impairment charges",
        "$94.2",
        "$394.0",
        "$211.4"
      ],
      [
        "Net losses on sales or disposals of assets",
        "45.1",
        "85.6",
        "32.8"
      ],
      [
        "Other operating expenses",
        "27.0",
        "33.7",
        "11.8"
      ],
      [
        "Total Other operating expenses",
        "$166.3",
        "$513.3",
        "$256.0"
      ]
    ]
  },
  "context": "AMERICAN TOWER CORPORATION AND SUBSIDIARIES NOTES TO CONSOLIDATED FINANCIAL STATEMENTS (Tabular amounts in millions, unless otherwise disclosed) 17. OTHER OPERATING EXPENSE Other operating expense consists primarily of impairment charges, net losses on sales or disposals of assets and other operating expense items. The Company records impairment charges to write down certain assets to their net realizable value after an indicator of impairment is identified and subsequent analysis determines that the asset is either partially recoverable or not recoverable. These assets consisted primarily of towers and related assets, which are typically assessed on an individual basis, network location intangibles, which relate directly to towers, and tenant-related intangibles, which are assessed on a tenant basis. Net losses on sales or disposals of assets primarily relate to certain non-core towers, other assets and miscellaneous items. Other operating expenses includes acquisition-related costs and integration costs. Other operating expenses included the following for the years ended December 31,:",
  "image_cues": "",
  "user_profile": "general",
  "questions": {
    "a5992e2e-726e-469c-88f3-e7b2ea8db24c": "What were the Other operating expenses in 2019?",
    "f9ece440-2717-41fa-b69e-05a3339f9cef": "What was the Total Other operating expenses in 2018?",
    "ce6dd8c2-37c9-4c55-80d5-89ab35ae254f": "What was the Net losses on sales or disposals of assets in 2019?",
    "3d384cee-82de-48f1-98ff-a972404bce4c": "How many expenses segments in 2019 were above $50 million?",
    "54df78bf-1e81-4ebe-ba8d-278fee472ffd": "How many expenses segments  in 2018 were below $100 million?",
    "58adf6c4-41ae-4f3f-84cb-cf3469a80ce4": "What was the percentage change in Total Other operating expenses between 2018 and 2019?"
  }
}