{
  "table": {
    "uid": "34f239a7-17d1-4f11-8267-adc13f486668",
    "table": [
      [
        "",
        "December 31,",
        ""
      ],
      [
        "",
        "2019",
        "2018"
      ],
      [
        "Billed receivables",
        "$213,654",
        "$239,275"
      ],
      [
        "Allowance for doubtful accounts",
        "(5,149)",
        "(3,912)"
      ],
      [
        "Billed receivables, net",
        "208,505",
        "235,363"
      ],
      [
        "Accrued receivables",
        "399,302",
        "336,858"
      ],
      [
        "Significant financing component",
        "(35,569 )",
        "(35,029 )"
      ],
      [
        "Total accrued receivables, net",
        "363,733",
        "301,829"
      ],
      [
        "Less: current accrued receivables",
        "161,714",
        "123,053"
      ],
      [
        "Less: current significant financing component",
        "(11,022 )",
        "(10,234 )"
      ],
      [
        "Total long-term accrued receivables, net",
        "213,041",
        "189,010"
      ],
      [
        "Total receivables, net",
        "$572,238",
        "$537,192"
      ]
    ]
  },
  "context": "Contract Balances Timing of revenue recognition may differ from the timing of invoicing to customers. The Company records an accrued receivable when revenue is recognized prior to invoicing and the Company’s right to consideration only requires the passage of time, or deferred revenue when revenue is recognized subsequent to invoicing. Total receivables represent amounts billed and amounts earned that are to be billed in the future (i.e., accrued receivables). Included in accrued receivables are services and SaaS and PaaS revenues earned in the current period but billed in the following period and amounts due under multi-year software license arrangements with extended payment terms for which the Company has an unconditional right to invoice and receive payment subsequent to invoicing. Total receivables, net is comprised of the following (in thousands): No customer accounted for more than 10% of the Company’s consolidated receivables balance as of December 31, 2019 and 2018.",
  "image_cues": "",
  "user_profile": "general",
  "questions": {
    "0b890b7c-4b06-4672-93bd-dc0a40436510": "When does the company record an accrued receivable?",
    "f88c39d3-3a3b-4b79-bf6e-0eb1bc708a3e": "What was the billed receivables in 2019?",
    "93fc7ba4-3659-46a9-939d-013ddbc10950": "What was the billed receivables in 2018?",
    "61c265a7-bfcd-4b54-b83c-65881267a2c8": "What was the change in billed receivables between 2018 and 2019?",
    "4c42c33e-d8b3-4b54-bb22-76c5600fbc09": "What was the change in accrued receivables between 2018 and 2019?",
    "93c3d11c-cf30-4464-a882-479f5f0b3f79": "What was the percentage change in total receivables, net between 2018 and 2019?"
  }
}