{
  "table": {
    "uid": "3789d7da-dc3e-4cd7-b639-d6805211405a",
    "table": [
      [
        "",
        "Revenues",
        "",
        "Income (loss) from vessel operations",
        ""
      ],
      [
        "(in thousands of U.S. dollars)",
        "2019",
        "2018",
        "2019",
        "2018"
      ],
      [
        "Teekay LNG",
        "601,256",
        "510,762",
        "299,253",
        "148,599"
      ],
      [
        "Teekay Tankers",
        "943,917",
        "776,493",
        "123,883",
        "7,204"
      ],
      [
        "Teekay Parent",
        "413,806",
        "451,659",
        "(219,094)",
        "8,516"
      ],
      [
        "Elimination of intercompany (1)",
        "(13,588)",
        "(10,426)",
        "—",
        "—"
      ],
      [
        "Teekay Corporation Consolidated",
        "1,945,391",
        "1,728,488",
        "204,042",
        "164,319"
      ]
    ]
  },
  "context": "RECENT DEVELOPMENTS AND RESULTS OF OPERATIONS The results of operations that follow have first been divided into (a) our controlling interests in our publicly-traded subsidiaries Teekay LNG and Teekay Tankers and (b) Teekay Parent. Within these groups, we have further subdivided the results into their respective lines of business. The following table (a) presents revenues and income (loss) from vessel operations for each of Teekay LNG and Teekay Tankers, and for Teekay Parent, and (b) reconciles these amounts to our consolidated financial statements. (1) During 2019, Teekay Tankers' ship-to-ship transfer business provided operational and maintenance services to Teekay LNG Bahrain Operations L.L.C., an entity wholly-owned by Teekay LNG, for the LNG receiving and regasification terminal in Bahrain. Also during 2019, the Magellan Spirit LNG carrier was chartered by Teekay LNG to Teekay Parent for a short period of time. During 2018, Teekay Parent chartered in two LNG carriers from Teekay LNG until March and April 2018.",
  "image_cues": "",
  "user_profile": "general",
  "questions": {
    "764e5559-92f5-4d41-afea-941e0beda820": "How is results of operations have been divided?",
    "f8011fb0-e5d3-464f-85c0-1d6752a8617c": "What is the increase/ (decrease) in Revenues of Teekay LNG from, 2019 to 2018?",
    "214a2cb0-5810-4004-9020-33578ea08030": "What is the increase/ (decrease) in Revenues of Teekay Tankers from, 2019 to 2018?",
    "f2953826-279c-43c2-8096-a4bf7f862b59": "In which years was Teekay LNG revenue less than 600,000 thousands?",
    "9b6759c8-7813-4657-98ba-9f1e714a6c03": "What was the Teekay LNG revenue in 2018 and 2019?",
    "0d3b0bd9-d68d-4734-af38-b92755c0bc9e": "In which period did Teekay Tankers' ship-to-ship transfer provided operational and maintenance services to Teekay LNG Bahrain?"
  }
}