{
  "table": {
    "uid": "37fc1d68-ab05-4913-8fe6-4cbaafdc39cf",
    "table": [
      [
        "",
        "2019",
        "",
        "2018",
        ""
      ],
      [
        "",
        "Men",
        "Women",
        "Men",
        "Women"
      ],
      [
        "",
        "Years",
        "Years",
        "Years",
        "Years"
      ],
      [
        "Member aged 65 (current life expectancy)",
        "86.8",
        "88.9",
        "87.3",
        "89.3"
      ],
      [
        "Member aged 45 (life expectancy at age 65)",
        "88.5",
        "90.7",
        "89.0",
        "91.1"
      ]
    ]
  },
  "context": "The Group has assumed that mortality will be in line with nationally published mortality table S2NA with CMI 2018 projections related to members’ years of birth with long-term rate of improvement of 1.5% per annum. These tables translate into an average life expectancy for a pensioner retiring at age 65 as follows: It is assumed that 50% of non-retired members of the Scheme will commute the maximum amount of cash at retirement (2018: 50% of\nnon-retired members of the Scheme will commute the maximum amount of cash at retirement).",
  "image_cues": "",
  "user_profile": "general",
  "questions": {
    "9e6b0eeb-e33c-454f-92fe-8ac2bbec81f4": "What is the Group's assumptions on mortality?",
    "bf146b6a-47c4-41d8-9238-217c9d514785": "What is the current average life expectancy in 2019 for a male member aged 65 in years?",
    "26b8233e-d9c5-4f99-97d7-637081790f3e": "For which years is the average life expectancy for a pensioner retiring at age 65 provided for?",
    "ec360d0b-1c10-4889-b8a6-a5a2e57e6810": "In which year was the average life expectancy for a male member aged 65 higher?",
    "ff71e762-7a3d-4b9e-aa75-3ab148d8154c": "What was the change in the average life expectancy for a male member aged 65 in 2019 from 2018?",
    "8cf06f37-dccd-4b16-8f75-5359a9a55d93": "What was the percentage change in the average life expectancy for a male member aged 65 in 2019 from 2018?"
  }
}