{
  "table": {
    "uid": "52164b70-6973-4844-af6a-76e8f1298d64",
    "table": [
      [
        "",
        "Domestic",
        "",
        "International",
        ""
      ],
      [
        "",
        "September 30,",
        "",
        "September 30,",
        ""
      ],
      [
        "",
        "2019",
        "2018",
        "2019",
        "2018"
      ],
      [
        "Discount rate",
        "4.00%",
        "3.75%",
        "1.90%",
        "2.80%"
      ],
      [
        "Expected return on plan assets",
        "",
        "",
        "3.40%",
        "3.70%"
      ],
      [
        "Rate of compensation increase",
        "",
        "",
        "- - %",
        "- - %"
      ]
    ]
  },
  "context": "The following table provides the weighted average actuarial assumptions used to determine net periodic benefit costfor years ended: For domestic plans, the discount rate was determined by comparison against the FTSE pension liability index for AA rated corporate instruments. The Company monitors other indices to assure that the pension obligations are fairly reported on a consistent basis. The international discount rates were determined by comparison against country specific AA corporate indices, adjusted for duration of the obligation. The periodic benefit cost and the actuarial present value of projected benefit obligations are based on actuarial assumptions that are reviewed on an annual basis. The Company revises these assumptions based on an annual evaluation of longterm trends, as well as market conditions that may have an impact on the cost of providing retirement benefits.",
  "image_cues": "",
  "user_profile": "general",
  "questions": {
    "682e2b7e-2b40-4849-8671-2b85dd3c7f10": "How is the discount rate for domestic plans determined?",
    "de34ea96-2a39-4cd5-b4a3-62b0f730103a": "How is the discount rate for international plans determined?",
    "0f032004-ec01-40a0-831b-aac3f7e1b5c7": "How often does the company review the actuarial assumptions which the periodic benefit cost and the actuarial present value of projected benefit obligations are based on?",
    "5103aed0-b4e8-4fae-bf78-e2c9f4ba84cf": "What is the difference between the domestic and international discount rates as at September 30, 2019?",
    "4dc8be43-d8d9-4b08-9ffd-9c19012361ce": "What is the year on year percentage change in domestic discount rate between 2018 and 2019?",
    "6c44a1a8-0785-43a0-90ab-7e21df2c57d9": "What is the year on year percentage change in international expected return on plan assets between 2018 and 2019?"
  }
}