{
  "table": {
    "uid": "5b874c83-80f7-48d2-bdac-166f2c778e37",
    "table": [
      [
        "",
        "Years Ended December 31,",
        ""
      ],
      [
        "",
        "2018",
        "2017"
      ],
      [
        "Interest expense",
        "$(2,085)",
        "$(3,343)"
      ],
      [
        "Interest income",
        "1,826",
        "1,284"
      ],
      [
        "Other (expense) income",
        "(2,676)",
        "3,817"
      ],
      [
        "Total other (expense) income, net",
        "$(2,935)",
        "$1,758"
      ]
    ]
  },
  "context": "Results of Operations: Years Ended December 31, 2018, versus Year Ended December 31, 2017 (Amounts in thousands, except percentages and per share amounts): Results of Operations: Years Ended December 31, 2018, versus Year Ended December 31, 2017 (Amounts in thousands, except percentages and per share amounts): Other income and expense items are summarized in the following table: Interest expense decreased in the year ended December 31, 2018, versus the same period in 2017 primarily due to lower debt balances, a reduction in interest related to interest rate swaps, and a one-time charge related to a liability that was settled in 2017. Interest income increased due to higher interest rates. Other expense in the year ended December 31, 2018, was driven by foreign currency translation losses mainly due to the appreciation of the U.S. Dollar compared to the Chinese Renminbi and the Euro. Other income in the year ended December 31, 2017 was driven mainly by foreign currency translation gains due to the depreciation of the U.S. Dollar compared to the Chinese Renminbi and the Euro.",
  "image_cues": "",
  "user_profile": "general",
  "questions": {
    "01e88bf6-f6b1-41de-bd60-b272255d3ad9": "Why did Interest expense decrease in the year ended December 31, 2018, versus the same period in 2017?",
    "3815da05-2eae-4248-b313-82dab2c3c6df": "What was the interest expense in 2018?",
    "8757782d-306d-4a0d-b22e-ab0f2b58171c": "What was the Total other (expense) income, net in 2017?",
    "49015c16-be28-4fb6-be59-7fd595c94c8d": "How many years did interest income exceed $1,500 thousand?",
    "38bfd292-e881-4558-89f8-5139010db8cf": "What was the change in interest expense between 2017 and 2018?",
    "a9fa838a-1b85-47f0-a6f7-716f8bb333a1": "What was the percentage change in the net Total other (expense) income between 2017 and 2018?"
  }
}