{
  "table": {
    "uid": "7d228e82-671c-4b83-aad1-405493c0aa0c",
    "table": [
      [
        "",
        "2019",
        "2018"
      ],
      [
        "",
        "Tonnes of CO2e",
        "Tonnes of CO2e"
      ],
      [
        "Emissions from:",
        "",
        ""
      ],
      [
        "Combustion of fuel and operation of facilities (Scope 1)",
        "144.7",
        "137.2"
      ],
      [
        "Electricity, heat, steam and cooling purchased for own use (Scope 2)",
        "4,641.0",
        "4,950.4"
      ],
      [
        "Total emissions",
        "4,785.7",
        "5,087.6"
      ],
      [
        "Emissions intensity metrics:",
        "",
        ""
      ],
      [
        "Normalised per FTE employee",
        "3.46",
        "3.57"
      ],
      [
        "Normalised per square metre of gross internal area of our facilities",
        "0.114",
        "0.125"
      ],
      [
        "Normalised per $ million of revenues",
        "9.50",
        "10.67"
      ]
    ]
  },
  "context": "Greenhouse gas emissions Spirent is committed to acting to combat climate change and reporting its progress. Our total Scope 1 and 2 emissions dropped by 6.14 per cent from 2018, and our emissions per $ million of revenue were down by 10.9 per cent. We have reduced our total emissions by 29 per cent since our 2014 baseline. The Group responded to the Carbon Disclosure Project in 2019, completing the Climate Change and Supply Chain questionnaires. In 2019 we achieved a Climate Change rating of B (management) (2018 C) and a Supplier Engagement rating of B (management) (2018 B). The average for our sector is C in both categories.",
  "image_cues": "",
  "user_profile": "general",
  "questions": {
    "8ee0cd9a-0820-4710-8fb5-52fdf0cf94c3": "What is the percentage change in the total amount of emissions from Combustion of fuel and operation of facilities and Electricity, heat, steam and cooling purchased for own use?",
    "1b99bb00-5a16-471c-9d0a-c48075e844ae": "By how much has Spirent reduced their total emissions since their 2014 baseline?",
    "a622beb5-c086-489c-b3c4-081797b0b19f": "What are the scopes of emissions?",
    "d1dec9f8-616f-4c60-9a5d-f31904b85014": "In which year were the Scope 1 emissions larger?",
    "ee74c321-b0e8-44f6-b15a-a4e8511b6183": "What was the change in total emissions?",
    "d5656a8c-6ef7-4e56-a3d4-8e3dc2bd5bed": "What was the percentage change in total emissions?"
  }
}