{
  "table": {
    "uid": "9e0ae25d-0080-4fb6-8396-db61af489520",
    "table": [
      [
        "",
        "",
        "Year ended March 31,",
        ""
      ],
      [
        "",
        "2019",
        "2018",
        "2017"
      ],
      [
        "Effect of foreign exchange rate changes on cash and cash equivalents",
        "—",
        "—",
        "(1.0)"
      ],
      [
        "Net decrease in cash and cash equivalents",
        "(472.7)",
        "(7.4)",
        "(1,184.0)"
      ],
      [
        "Cash and cash equivalents, and restricted cash at beginning of period (2)",
        "901.3",
        "908.7",
        "2,092.7"
      ],
      [
        "Cash and cash equivalents, and restricted cash at end of period (2)",
        "$428.6",
        "$901.3",
        "$908.7"
      ]
    ]
  },
  "context": "MICROCHIP TECHNOLOGY INCORPORATED AND SUBSIDIARIES CONSOLIDATED STATEMENTS OF CASH FLOWS (in millions) Schedule of restricted cash: (2) During the fiscal year ended March 31, 2019, the Company adopted ASU 2016-18 - Statement of Cash Flows: Restricted Cash. The following table presents the balance of restricted cash which consists of cash denominated in a foreign currency and restricted in use due to a foreign taxing authority requirement (in millions):",
  "image_cues": "",
  "user_profile": "general",
  "questions": [
    "What was the Net decrease in cash and cash equivalents in 2019?",
    "What was the Cash and cash equivalents, and restricted cash at beginning of period in 2018?",
    "Which years does the table provide information for Cash and cash equivalents, and restricted cash at end of period?",
    "What was the change in Cash and cash equivalents, and restricted cash at beginning of period between 2017 and 2018?",
    "How many years did Cash and cash equivalents, and restricted cash at beginning of period exceed $1,000 million?",
    "What was the percentage change in Cash and cash equivalents, and restricted cash at end of period between 2018 and 2019?"
  ],
  "answer_scales": [
    "million",
    "million",
    "",
    "million",
    "",
    "percent"
  ],
  "answer_types": [
    "span",
    "span",
    "multi-span",
    "arithmetic",
    "count",
    "arithmetic"
  ]
}
