{
  "table": {
    "uid": "d62ea892-9da4-4f67-928d-35e78b798e5e",
    "table": [
      [
        "",
        "",
        "Year Ended December 31,",
        ""
      ],
      [
        "",
        "2019",
        "2018",
        "2017"
      ],
      [
        "Net cash provided by operating activities",
        "$115,549",
        "$90,253",
        "$67,510"
      ],
      [
        "Net cash used in investing activities",
        "(97,727)",
        "(20,876)",
        "(36,666)"
      ],
      [
        "Net cash provided by (used in) financing activities",
        "14,775",
        "(278,016)",
        "276,852"
      ]
    ]
  },
  "context": "The following table sets forth a summary of our cash flows for the periods indicated (in thousands): Our cash flows from operating activities are significantly influenced by our growth, ability to maintain our contractual billing and collection terms, and our investments in headcount and infrastructure to support anticipated growth. Given the seasonality and continued growth of our business, our cash flows from operations will vary from period to period. Cash provided by operating activities was $115.5 million in 2019, compared to $90.3 million in 2018. The increase in operating cash flow was primarily due to improved profitability, improved collections, and other working capital changes in 2019 when compared to 2018.",
  "image_cues": "",
  "user_profile": "general",
  "questions": [
    "What were the company's cash flows from operating activities influenced by?",
    "What was the net cash provided by operating activities in 2017?",
    "What was the net cash provided by financing activites in 2019?",
    "What was the average net cash provided by operating activities from 2017-2019?",
    "What is the percentage change in Net cash used in investing activities between 2018 and 2019?",
    "What is the percentage change in net cash provided by operating activities between 2017 and 2018?"
  ],
  "answer_scales": [
    "",
    "thousand",
    "thousand",
    "thousand",
    "percent",
    "percent"
  ],
  "answer_types": [
    "span",
    "span",
    "span",
    "arithmetic",
    "arithmetic",
    "arithmetic"
  ]
}
