{
  "table": {
    "uid": "d7d65228-96c1-4890-951c-c3d7578f8031",
    "table": [
      [
        "",
        "Appropriation of earnings (in thousand NT dollars) Appropriation of earnings (in thousand NT dollars)",
        "",
        "Cash dividend per share (NT dollars)",
        ""
      ],
      [
        "",
        "2018",
        "2019",
        "2018",
        "2019"
      ],
      [
        "Legal reserve",
        "$707,299",
        "$963,947",
        "",
        ""
      ],
      [
        "Special reserve",
        "14,513,940",
        "(3,491,626)",
        "",
        ""
      ],
      [
        "Cash dividends",
        "6,916,105",
        "9,765,155",
        "$0.58",
        "$0.75"
      ]
    ]
  },
  "context": "According to the regulations of Taiwan Financial Supervisory Commission (FSC), UMC is required to appropriate a special reserve in the amount equal to the sum of debit elements under equity, such as unrealized loss on financial instruments and debit balance of exchange differences on translation of foreign operations, at every year-end. Such special reserve is prohibited from distribution. However, if any of the debit elements is reversed, the special reserve in the amount equal to the reversal may be released for earnings distribution or offsetting accumulated deficits. The distribution of earnings for 2018 was approved by the stockholders’ meeting held on June 12, 2019, while the distribution of earnings for 2019 was approved by the Board of Directors’ meeting on April 27, 2020. The details of distribution are as follows:",
  "image_cues": "",
  "user_profile": "general",
  "questions": [
    "What was the legal reserve amount in 2019?",
    "What is the implication for reserving debit elements?",
    "What was the cash dividend per share in 2019?",
    "What is the average Legal reserve within Appropriation of earnings?",
    "What is the increase/ (decrease) in Legal reserve within Appropriation of earnings from 2018 to 2019?",
    "What is the increase/ (decrease) in Cash dividends within Appropriation of earnings from 2018 to 2019?"
  ]
}