{
  "table": {
    "uid": "e8877535-8ade-4ba3-aae2-cd4db2b5c59c",
    "table": [
      [
        "Currency",
        "Weightage (%)",
        "FY 2019 `",
        "FY 2018 `",
        "% Change YoY"
      ],
      [
        "USD",
        "53.6",
        "70.07",
        "64.49",
        "8.7"
      ],
      [
        "GBP",
        "13.9",
        "91.60",
        "86.05",
        "6.5"
      ],
      [
        "EUR",
        "10.1",
        "80.82",
        "76.16",
        "6.1"
      ],
      [
        "Breakup of revenue growth",
        "FY 2019 (%)",
        "FY 2018 (%)",
        "",
        ""
      ],
      [
        "Business growth",
        "11.4",
        "6.7",
        "",
        ""
      ],
      [
        "Impact of exchange rate",
        "7.6",
        "(2.3)",
        "",
        ""
      ],
      [
        "Total growth",
        "19.0",
        "4.4",
        "",
        ""
      ]
    ]
  },
  "context": "a. Analysis of revenue growth On a reported basis, TCS’ revenue grew 19% in FY 2019, compared to 4.4% in the prior year. This was largely an outcome of greater demand for our services and solutions during the year, driven by expanding participation in our customers’ growth and transformation initiatives. In addition, there was some benefit from the movement in currency exchange rates. FY 2019 saw volatility in USD-INR, ranging from `64.90 and `74.10, and averaging at `70.07. There was also significant volatility in exchange rates of emerging markets’ currencies. Average currency exchange rates during FY 2019 for the three major currencies are given below: Movements in currency exchange rates through the year resulted in a positive impact of 7.6% on the reported revenue. The constant currency revenue growth for the year, which is the reported revenue growth stripped of the currency impact, was 11.4%.",
  "image_cues": "",
  "user_profile": "general",
  "questions": {
    "428f0639-82af-4a18-a169-b531c63f8fce": "What was the average USD-INR exchange rate in FY 2019?",
    "c3f4ec9b-2e21-42fd-950b-2e7b24e4b0b9": "What is the most expensive currency?",
    "99fd8872-7580-4480-887d-6c19ccbdf19d": "What is the least expensive currency?",
    "f96cce90-9703-4b6b-9ea4-1a650ac8765a": "What is the change in \"impact of exchange rate\" from FY 2018 to FY 2019?",
    "127264c3-16b9-4324-aff1-722420c93b5d": "What is the average INR-GBP exchange rate in FY 2019?",
    "3a467fa9-64d9-4214-9f5e-0e7a101efd57": "What is the average USD-EUR exchange rate in FY 2019?"
  }
}