{
  "table": {
    "uid": "f8ac9ddd-9872-4681-902d-a0ee7c0ee83a",
    "table": [
      [
        "",
        "December 31",
        ""
      ],
      [
        "",
        "2019",
        "2 0 1 8"
      ],
      [
        "",
        "U.S. $ in thousands",
        ""
      ],
      [
        "Operating loss carryforward",
        "73,260",
        "57,768"
      ],
      [
        "Net deferred tax asset before valuation allowance",
        "19,911",
        "15,916"
      ],
      [
        "Valuation allowance",
        "(19,911)",
        "(15,916)"
      ],
      [
        "Net deferred tax asset",
        "795",
        "772"
      ]
    ]
  },
  "context": "NOTE 13 - TAXES ON INCOME B. Deferred income taxes: Deferred income taxes reflect the net tax effects of temporary differences between the carrying amounts of assets and liabilities for financial reporting purposes and the amounts used for income tax purposes. Significant components of the Company's deferred tax assets are as follows: As of December 31, 2019, the Company has provided a full valuation allowances of $19,911 in respect of deferred tax assets resulting from tax loss carryforward and other temporary differences. Management currently believes that because the Company has a history of losses, it is more likely than not that the deferred tax regarding the loss carryforward and other temporary differences will not be realized in the foreseeable future.",
  "image_cues": "",
  "user_profile": "general",
  "questions": {
    "c3993366-da98-42f2-a5b2-3de28c4d0e10": "What was the operating loss carryforward amount in 2019 and 2018 respectively?",
    "5c7d8918-6083-4ac1-a0eb-137a114a7cd7": "What was the net deferred tax asset before valuation allowance amount in 2019 and 2018 respectively?",
    "55cba0fe-5e0a-45b5-af6b-97a6e77f81e2": "What was the net deferred tax asset amount in 2019 and 2018 respectively?",
    "bed1fce2-69cb-4d1e-a34a-01950a1770bd": "What is the percentage change in the operating loss carryforward from 2018 to 2019?",
    "348d031d-73ab-4b35-af46-998cfef25775": "What is the percentage change in the valuation allowance from 2018 to 2019?",
    "aea850af-68cb-4cc1-80b2-c9c2860b273e": "What is the percentage change in the net deferred tax asset from 2018 to 2019?"
  }
}