{
  "table": {
    "uid": "fa0d7378-4217-44f1-bfb0-38688f03bdf3",
    "table": [
      [
        "",
        "Year Ended March 31,",
        ""
      ],
      [
        "",
        "2019",
        "2018"
      ],
      [
        "Net sales",
        "$5,563.7",
        "$5,875.0"
      ],
      [
        "Net income (loss)",
        "$542.0",
        "$(762.3)"
      ],
      [
        "Basic net income (loss) per common share",
        "$2.29",
        "$(3.27)"
      ],
      [
        "Diluted net income (loss) per common share",
        "$2.17",
        "$(3.27)"
      ]
    ]
  },
  "context": "Note 2. Business Acquisitions Acquisition of Microsemi The following unaudited pro-forma consolidated results of operations for the fiscal year ended March 31, 2019 and 2018 assume the closing of the Microsemi acquisition occurred as of April 1, 2017. The pro-forma adjustments are mainly comprised of acquired inventory fair value costs and amortization of purchased intangible assets. The pro-forma results of operations are presented for informational purposes only and are not indicative of the results of operations that would have been achieved if the acquisition had taken place on April 1, 2017 or of results that may occur in the future (in millions except per share data):",
  "image_cues": "",
  "user_profile": "general",
  "questions": {
    "197c37a3-cd56-4eef-bccc-756f88753971": "What were the pro-forma adjustments mainly comprised of?",
    "a71f8ab2-6518-40c2-a4f4-f49a2ab18324": "What were the net sales in 2019?",
    "54087793-6e0a-454f-aa50-f39a24bf8d1b": "Which years does the table provide information for the unaudited pro-forma consolidated results of operations? ",
    "61610e9a-13c4-4670-8616-c6218f7793ad": "What was the change in the Basic net income per common share between 2018 and 2019?",
    "0914b0c3-0f42-480f-a2d3-3368f48eaba6": "What was the percentage change in net sales between 2018 and 2019?",
    "14501a2e-1369-44f4-aa58-c5eb42c8d68b": "What was the percentage change in Net income between 2018 and 2019?"
  }
}