{
  "table": {
    "uid": "fe20d447-868a-42f1-8073-843cb3a1e3e8",
    "table": [
      [
        "",
        "Total Expected Charges",
        "Cumulative Charges Incurred",
        "Remaining Expected Charges"
      ],
      [
        "",
        "",
        "(in millions)",
        ""
      ],
      [
        "Transportation Solutions",
        "$  160",
        "$  144",
        "$  16"
      ],
      [
        "Industrial Solutions",
        "80",
        "66",
        "14"
      ],
      [
        "Communications Solutions",
        "49",
        "44",
        "5"
      ],
      [
        "Total",
        "$  289",
        "$  254",
        "$  35"
      ]
    ]
  },
  "context": "Fiscal 2019 Actions During fiscal 2019, we initiated a restructuring program associated with footprint consolidation and structural improvements impacting all segments. In connection with this program, during fiscal 2019, we recorded net restructuring charges of $254 million. We expect to complete all restructuring actions commenced during fiscal 2019 by the end of fiscal 2021 and to incur additional charges of approximately $35 million related primarily to employee severance and facility exit costs in the Transportation Solutions and Industrial Solutions segments. The following table summarizes expected, incurred, and remaining charges for the fiscal 2019 program by segment:",
  "image_cues": "",
  "user_profile": "general",
  "questions": {
    "b58e2259-53c4-4357-a8ad-1bdce8324703": "What program was initiated during fiscal 2019?",
    "c0504ce5-6532-4dfb-b3cd-246a6544c65a": "What charges does the table summarize for the fiscal 2019 program?",
    "efbff294-365a-47c4-b530-7de812c65bf3": "What are the segments for which the expected, incurred, and remaining charges for the fiscal 2019 program are recorded?",
    "5df79322-fdde-48f5-9b2c-e6350a4474c4": "In which segment was the Remaining Expected Charges the largest?",
    "6315382f-6dba-46d9-adc5-08a0ad6efb7a": "What was the difference in total expected charges between Transportation Solutions and Industrial Solutions?",
    "54b11fb5-014a-4042-affa-fe96ea5e5eaa": "What was the average amount of total expected charges per segment?"
  }
}