{
  "context": "Page: List of National Natural Landmarks in Michigan | Section: National Natural Landmarks | Source: http://en.wikipedia.org/wiki/List_of_National_Natural_Landmarks_in_Michigan",
  "questions": [
    "When were the first and most recent destinations built?"
  ],
  "table": {
    "table": [
      [
        "Name",
        "Date",
        "Location",
        "County",
        "Ownership",
        "Description"
      ],
      [
        "Black Spruce Bog Natural Area",
        "1976",
        "42°18′58.00″N 84°11′46.49″W / 42.3161111°N 84.1962472°W",
        "Jackson",
        "State",
        "A boreal bog forest with a stand of black spruce; illustrates the last stage of evolution in a sphagnum bog ecosystem."
      ],
      [
        "Dead Stream Swamp",
        "1976",
        "44°6′0″N 84°10′12″W / 44.10000°N 84.17000°W",
        "Missaukee, Roscommon",
        "State",
        "An extensive northern white cedar swamp, illustrating the last stage of bog forest evolution. Part of Au Sable State Forest."
      ],
      [
        "Dukes Research Natural Area",
        "1974",
        "46°21′0″N 87°10′0.01″W / 46.35000°N 87.1666694°W",
        "Marquette",
        "Federal",
        "A swamp containing undisturbed stands of cedar and mixed conifers and old-growth hardwood. Part of Hiawatha National Forest."
      ],
      [
        "Grand Mere Lakes",
        "1968",
        "41°59′35″N 86°32′59″W / 41.99306°N 86.54972°W",
        "Berrien",
        "State, private",
        "Contains multiple low areas created by Lake Michigan's post-glacial ancestors, illustrating aquatic to terrestrial evolution. Provides habitat for several rare species."
      ],
      [
        "Haven Hill State Natural Area",
        "1976",
        "42°38′11″N 83°34′23″W / 42.63639°N 83.57306°W",
        "Oakland",
        "State",
        "A small area that incorporates all forest types found in southern Michigan; plays host to over 100 bird species and 17 species of mammals."
      ],
      [
        "Newton Woods",
        "1976",
        "42°0′32.7594″N 85°58′16.32″W / 42.009099833°N 85.9712000°W",
        "Cass",
        "State",
        "One of the Lower Peninsula's last remaining old-growth, mixed-oak hardwood forests. Part of the Michigan State University managed Fred Russ Forest."
      ],
      [
        "Porcupine Mountains",
        "1984",
        "46°46′N 89°45′W / 46.767°N 89.750°W",
        "Gogebic, Ontonagon",
        "State",
        "Contains extensive white pine and virgin northern hemlock, as well as wave-cut beaches that mark the shorelines of ancient glacial lakes."
      ],
      [
        "Roscommon Virgin Pine Stand",
        "1980",
        "44°6′0″N 84°10′12″W / 44.10000°N 84.17000°W",
        "Roscommon",
        "State",
        "A large stand of old-growth red pine with a documented history of wildfires stretching back to 1798. Part of Au Sable State Forest."
      ],
      [
        "Strangmoor Bog",
        "1973",
        "46°15′N 86°06′W / 46.250°N 86.100°W",
        "Schoolcraft",
        "Federal",
        "An undisturbed example of a string bog, one of the southernmost locations of this type of bog. Part of Seney National Wildlife Refuge."
      ],
      [
        "Tobico Marsh",
        "1976",
        "43°41′51″N 83°56′11″W / 43.69750°N 83.93639°W",
        "Bay",
        "State",
        "A mixture of relatively undisturbed hardwood forest, open water and marshland, frequently used by migrating waterfowl. Part of Bay City Recreation Area."
      ],
      [
        "Toumey Woodlot",
        "1976",
        "42°42′13.428″N 84°27′54.36″W / 42.70373000°N 84.4651000°W",
        "Ingham",
        "State",
        "One of southern Michigan's last virgin beech-maple forests; located on the Michigan State University campus and used for ecological research. Managed by Michigan State University."
      ],
      [
        "Warren Woods Natural Area",
        "1967",
        "41°50′00″N 86°37′20″W / 41.83333°N 86.62222°W",
        "Berrien",
        "Private",
        "One of southern Michigan's last virgin beech-maple forests. Also includes sizable individual specimens of beech, maple and sycamore."
      ]
    ],
    "highlighted_cells": [
      [
        7,
        0
      ],
      [
        7,
        1
      ],
      [
        12,
        0
      ],
      [
        12,
        1
      ]
    ]
  },
  "image_cues": "",
  "image_path": [],
  "user_profile": "general"
}