{
  "question": "Queen Mab, is a fairy referred to in William Shakespeare's play \"Romeo and Juliet\", where \"she is the fairies' midwife\", in her play, her activity is described in a famous speech by which fictional character in William Shakespeare's 1597 tragedy, a close friend to Romeo and a blood relative to Prince Escalus and Count Paris?",
  "image_path": [],
  "table": [],
  "context": "Mercutio (/mərˈkjuːʃioʊ/ mər-KEW-shee-oh) is a fictional character in William Shakespeare's 1597 tragedy, Romeo and Juliet. He is a close friend to Romeo and a blood relative to Prince Escalus and Count Paris. As such, being neither a Montague nor a Capulet, Mercutio is one of the few in Verona with the ability to mingle around those of both houses. The invitation to Capulet's party states that he has a brother named Valentine.\n\nQueen Mab (pronunciation: \"M/ă/v\")[citation needed] is a fairy referred to in William Shakespeare's play Romeo and Juliet, where \"she is the fairies' midwife.\"  Later, she appears in other poetry and literature, and in various guises in drama and cinema. In the play, her activity is described in a famous speech by Mercutio written originally in prose and often adapted into iambic pentameter, in which she is described as a miniature creature who performs midnight pranks upon sleepers.  Being driven by a team of atomies, she rides her chariot over their noses and \"delivers the fancies of sleeping men.\"  Additionally, while driving \"O'er ladies' lips, who straight on kisses dream,\" she was known to change her mind and instead \"plague\" \"ladies' lips\" \"with blisters\" if she smelled \"sweetmeats\" or candied fruit eaten to sweeten their breath.  Along with this interpretation, others[who?] believe the blisters were a reference to the plague or to herpes simplex. She is also described as a midwife to help sleepers 'give birth' to their dreams. She may be a figure borrowed from folklore, and though she is often associated with the Irish Medb in popular culture, and has been suggested by historian Thomas Keightley to be from Habundia, a more likely origin for her name would be from Mabel and the Middle English derivative \"Mabily\" (as used by Chaucer) all from the Latin amabilis (\"lovable\").",
  "image_cues": "",
  "user_profile": "general"
}