{
  "question": "What hydroelectric dam located on the Little Tennessee River in Swain and Graham counties, North Carolina, United States is home to MINIs on the Dragon is an annual gathering of MINI Coopers in Robbinsville, North Carolina? ",
  "image_path": [],
  "table": [],
  "context": "MINIs on the Dragon is an annual gathering of MINI Coopers in Robbinsville, North Carolina.  Started in 2003, the event takes place over the first weekend of May each year. The event is in part named after the legendary section of US 129 known as \"The Dragon\" which runs from North Carolina to Tennessee and has 318 curves in 11 miles.  The event attracts over 900 attendees and over 600 MINI Coopers. The record was over 800 cars.  The event primarily is attended by the newer BMW MINI Coopers but also attracts several classic Mini Coopers each year.  This is the largest grassroots MINI Cooper event in the US each year. The event \"headquarters\" is in Fontana Village, a quaint vacation resort that was originally built to house the workers as they built the Fontana Dam during World War II.   Each year MINI owners from over 30 different States and Canada make the pilgrimage to Fontana Village to participate in this event. Starting off as a three-day event, it has currently grown into its newer format of four days and includes a vendor alley, group dinners, a Brewswap, Bingo Night and a host of various drives and other activities, there is the Friday morning Dragon Parade, the Saturday night Midnight on the Dragon. Brave MINI's gather at Deals Gap and at 00:00 depart and drive the Dragon.\n\nFontana Dam is a hydroelectric dam on the Little Tennessee River in Swain and Graham counties, North Carolina, United States.  The dam is operated by the Tennessee Valley Authority, which built the dam in the early 1940s to accommodate the skyrocketing electricity demands in the Tennessee Valley at the height of World War II.  At 480 feet (150 m) high, Fontana is the tallest dam in the Eastern United States, and at the time of its construction, it was the fourth tallest dam in the world.  The dam and associated infrastructure was listed on the National Register of Historic Places in 2017.",
  "image_cues": "",
  "user_profile": "general"
}