{
  "question": "The Hunger Games: Catching Fire is the sequel to the science fiction film directed by whom?",
  "image_path": [],
  "table": [],
  "context": "The Hunger Games: Catching Fire is a 2013 American dystopian science fiction adventure film based on Suzanne Collins' dystopian novel Catching Fire (2009), the second installment in The Hunger Games trilogy. The film is the sequel to The Hunger Games (2012) and the second installment in The Hunger Games film series, produced by Nina Jacobson and Jon Kilik, and distributed by Lionsgate. Francis Lawrence directed the film, with a screenplay by Simon Beaufoy and Michael Arndt. Adding to the existing cast, the supporting cast was filled out with Philip Seymour Hoffman, Jeffrey Wright, Jena Malone, Sam Claflin, Lynn Cohen, Amanda Plummer, Alan Ritchson, and Meta Golding. Filming began on September 10, 2012, in Atlanta, Georgia, before moving to Hawaii. The plot of Catching Fire takes place a few months after the previous installment; Katniss Everdeen and fellow District 12 tribute Peeta Mellark have returned home safely after winning the 74th Annual Hunger Games. Throughout the story, Katniss senses that a rebellion against the oppressive Capitol is simmering throughout the districts.\n\nThe Hunger Games is a 2012 American post-apocalyptic dystopian science fiction action adventure film directed by Gary Ross and based on the novel of the same name by Suzanne Collins.  It is the first installment in The Hunger Games film series and was produced by Nina Jacobson and Jon Kilik, with a screenplay by Ross, Collins, and Billy Ray. The film stars Jennifer Lawrence, Josh Hutcherson, Liam Hemsworth, Woody Harrelson, Elizabeth Banks, Lenny Kravitz, Stanley Tucci, and Donald Sutherland. The story takes place in a dystopian post-apocalyptic future in the nation of Panem, which is divided into 12 districts, where a boy and a girl from each district, between the ages of 12 and 18 must take part in The Hunger Games, a televised annual event in which the \"tributes\" of each district, are required to fight to the death, until there is only one survivor. Katniss Everdeen (Jennifer Lawrence) volunteers to take her younger sister's place. With her district's male tribute, Peeta Mellark (Josh Hutcherson), Katniss travels to the Capitol to train for the Hunger Games under the guidance of former victor Haymitch Abernathy (Woody Harrelson).",
  "image_cues": "",
  "user_profile": "general"
}