{
  "question": "Sandra Buckler is a former director of communications for the Office of the Prime Minister of Canada under Conservative Party of Canada Prime Minister Stephen Harper, she joined Canadian Tire Corporation, Limited, a Canadian retail company which sells a wide range of automotive, sports and leisure, and home products, as Vice President of communications in which year?",
  "image_path": [],
  "table": [],
  "context": "Canadian Tire Corporation, Limited is a Canadian retail company which sells a wide range of automotive, sports and leisure, and home products. Some stores also sell toys and food products. Retail operations include: Canadian Tire, the core retail and automotive service operation, which operates a large car repair garage in each store; Canadian Tire Petroleum; Mark's, a men’s, women’s, and work apparel retailer; sporting goods and sportswear retail conglomerate FGL Sports; and PartSource, which retails auto parts and accessories. The company's head office is in Toronto, Ontario. The retailer is known for its Canadian Tire money, a loyalty program first introduced in 1958, where customers are provided with coupons resembling paper money worth 0.4% of their purchase that can be used in subsequent purchases as scrip at Canadian Tire stores and gas stations.\n\nSandra Buckler is a former director of communications for the Office of the Prime Minister of Canada under Conservative Party of Canada Prime Minister Stephen Harper. She was appointed in 2006 and resigned from her position on June 26, 2008. Her tenure was contentious, including charges from the national media that she was overly restricted in sharing information, pressing journalists to instead focus on photo ops and adhering rigorously to talking points from the Office of the Prime Minister (PMO), as well as accusations from Members of Parliament that she had bullied them, and charges of conflict of interest. She joined Canadian Tire as Vice President of communications in 2015.",
  "image_cues": "",
  "user_profile": "general"
}