{
  "question": "What was the year of birth of the mathematician that is credited with developing infinitesimal calculus and using Jean Picard's measurement of earth to create his theory of universal gravitation?",
  "image_path": [],
  "table": [],
  "context": "Jean-Félix Picard (21 July 1620 – 12 July 1682) was a French astronomer and priest born in La Flèche, where he studied at the Jesuit Collège Royal Henry-Le-Grand. He died in Paris, France. He was the first person to measure the size of the Earth to a reasonable degree of accuracy in a survey conducted in 1669–70, for which he is honored with a pyramid at Juvisy-sur-Orge. Guided by Maurolycus's methodology and Snellius's mathematics for doing so, Picard achieved this by measuring one degree of latitude along the Paris Meridian using triangulation along thirteen triangles stretching from Paris to the clocktower of Sourdon, near Amiens. His measurements produced a result of 110.46 km for one degree of latitude, which gives a corresponding terrestrial radius of 6328.9 km. The polar radius has now been measured at just over 6357 km. This was an error only 0.44% less than the modern value. This was another example of advances in astronomy and its tools making possible advances in cartography. Picard was the first to attach a telescope with crosswires (developed by William Gascoigne) to a quadrant, and one of the first to use a micrometer screw on his instruments. The quadrant he used to determine the size of the Earth had a radius of 38 inches and was graduated to quarter-minutes. The sextant he used to find the meridian had a radius of six feet, and was equipped with a micrometer to enable minute adjustments. These equipment improvements made the margin of error only ten seconds, as opposed to Tycho Brahe's four minutes of error. This made his measurements 24 times as accurate. Isaac Newton was to use this value in his theory of universal gravitation.\n\nSir Isaac Newton PRS (/ˈnjuːtən/; 25 December 1642 – 20 March 1726/27) was an English mathematician, astronomer, theologian and physicist (described in his own day as a \"natural philosopher\") who is widely recognised as one of the most influential scientists of all time and a key figure in the scientific revolution.  His book Philosophiæ Naturalis Principia Mathematica (\"Mathematical Principles of Natural Philosophy\"), first published in 1687, laid the foundations of classical mechanics.  Newton also made pathbreaking contributions to optics, and he shares credit with Gottfried Wilhelm Leibniz for developing the infinitesimal calculus.",
  "image_cues": "",
  "user_profile": "general"
}