{
  "question": "Which collaborative studio album by American rappers Jay-Z and Kanye West by Roc-A-Fella Records, Roc Nation, and Def Jam Recordings did Frank Ocean make guest appearances?",
  "image_path": [],
  "table": [],
  "context": "Watch the Throne is a collaborative studio album by American rappers Jay-Z and Kanye West, released on August 8, 2011, by Roc-A-Fella Records, Roc Nation, and Def Jam Recordings. Before the album, Jay-Z and West had collaborated on their respective singles and with West as a producer on Jay-Z's work. As longtime friends, they originally sought out to record a five-song EP together, but the project eventually evolved into a full-length album. Recording sessions took place at various locations and began in November 2010. Production on the album was led by West himself, alongside a variety of high-profile record producers including Mike Dean, Swizz Beatz, Sak Pase, Jeff Bhasker, The Neptunes and Q-Tip.\n\nAmerican singer Frank Ocean has released two studio albums, one collaboration album, one mixtape, twelve singles and eight music videos. Following the flooding and destruction of his recording studio during Hurricane Katrina in 2005, Ocean moved from his hometown of New Orleans to the Californian city of Los Angeles, where he sought to continue his musical career, eventually landing himself a songwriting contract. In 2009, Ocean signed to Def Jam Recordings as a solo artist. Ocean also formed a friendship with rapper Tyler, The Creator, leader of the Los Angeles-based hip hop collective Odd Future (OFWGKTA) and subsequently became a member of Odd Future, as well as making three guest appearances on the album Goblin, including the single \"She\". In February 2011, he released his first major project, his first mixtape Nostalgia, Ultra, which produced two singles: \"Novacane\" and \"Swim Good\". \"Novacane\" became his first single to chart on the US Billboard Hot 100, where it peaked at number 82. Ocean also made two guest appearances on the Kanye West and Jay Z collaborative album Watch the Throne, including the single \"No Church in the Wild\", which peaked at number 72 on the Billboard Hot 100. Ocean has also written songs for several artists, such as Damienn Jones (\"Cinderella\" and \"Summertime\"), Brandy Norwood (\"1st & Love\" and \"Scared of Beautiful\"), John Legend (\"Quickly\"), Beyoncé (\"I Miss You\"), Bridget Kelly (\"Thinking About Forever\"), and Justin Bieber (\"Bigger\").",
  "image_cues": "",
  "user_profile": "general"
}