{
  "question": "what kind of animal is eileen from regular show",
  "image_path": [],
  "table": [],
  "context": "Rigby (voiced by William Salyers) is a 3'5\" anthropomorphic brown raccoon who works as a groundskeeper at The Park. He has been best friends with Mordecai since childhood and slacks off even more than Mordecai does. Rigby is hyperactive, immature, and extremely mischievous, which sometimes puts him at odds with Mordecai. He mostly lives for simply having a good time and relaxing, which he sometimes achieves through selfish acts like lying or cheating. He has a bad habit of getting himself and others in trouble, often causing many of the chaotic and surreal problems that arise in The Park. Nevertheless, he is shown to be a good person deep down and sticks closely to his friends. Like Mordecai, Rigby loves to play video games, but he is the worse of the two. He is also shown to be the weakest of The Park workers, although he has surprised them on a few occasions. Rigby's lack of strength was a major plot point in the episode \"One Pull Up,\" in which Rigby had to pass a company physical and keep his job by performing one pull up. He has a younger brother named \"Don\", whose height and physique lead people to believe that he, not Rigby, is the older brother. Eileen Roberts, a female mole who works at a local coffee shop, previously alongside Margaret Smith, has strong feelings for Rigby and makes this very obvious. He originally did not reciprocate her feelings and harshly ignored her at some points, but he quickly begins to warm up to her and implies that he likes her, as well. In \"Dumped at the Altar\", Rigby reveals to Mordecai that he and Eileen have been dating for 3 months. Rigby is allergic to eggs, as evidenced in the episode \"Eggscellent\" when Rigby tried to eat a 12-egg omelet to win a trucker hat and went into a coma due to a severe allergic reaction. Rigby has also died four times and was resurrected in the series. He was killed by Skips in an arm wrestling match, he was killed by Snowballs the monster, he was killed by Mordecai who pushed him into the Space-Time Continuum, and fell into a fatal coma in \"Eggscellent\". As of Rigby's Graduation Day Special, Rigby has finally graduated from high school. In the epilogue to \"A Regular Epic Final Battle\", Rigby quits The Park and moves in with Eileen. They eventually get married and start a family, but it's unknown if Rigby is working or not as he is seen teaching his children how to play video games.",
  "image_cues": "",
  "user_profile": "general"
}