{
  "question": "Wilma Glodean Rudolph, was an American sprinter from Clarksville, Tennessee, who became a world-record-holding Olympic champion and international sports icon in track and field, due to the worldwide television coverage of the 1960 Summer Olympics, Rudolph became an international star along with other Olympic athletes such as which American former National Basketball Association player who played for the Cincinnati Royals and Milwaukee Bucks?",
  "image_path": [],
  "table": [],
  "context": "Wilma Glodean Rudolph (June 23, 1940 – November 12, 1994) was an American sprinter from Clarksville, Tennessee, who became a world-record-holding Olympic champion and international sports icon in track and field following her successes in the 1956 and 1960 Olympic Games. Rudolph competed in the 200-meter dash and won a bronze medal in the 4 × 100-meter relay  at the 1956 Summer Olympics at Melbourne, Australia. She also won three gold medals in the 100- and 200-meter individual events and the 4 x 100-meter relay at the 1960 Summer Olympics in Rome, Italy. Rudolph was acclaimed the fastest woman in the world in the 1960s and became the first American woman to win three gold medals in a single Olympic Games. Due to the worldwide television coverage of the 1960 Summer Olympics, Rudolph became an international star along with other Olympic athletes such as Cassius Clay (later known as Muhammad Ali), Oscar Robertson, and Rafer Johnson who competed in Italy.\n\nOscar Palmer Robertson (born November 24, 1938), nicknamed \"The Big O\", is an American former National Basketball Association player who played for the Cincinnati Royals and Milwaukee Bucks. The 6 ft 5 in (1.96 m), 205 lb (93 kg) Robertson played  point guard and was a 12-time All-Star, 11-time member of the All-NBA Team, and one-time winner of the MVP award in 14 professional seasons. In 1962, he became the first of only two players in NBA history to average a triple-double for a season. In the 1970–71 NBA season, he was a key player on the team that brought the Bucks their only NBA title. His playing career, especially during high school and college, was plagued by racism.",
  "image_cues": "",
  "user_profile": "general"
}