{
  "question": "town replaced by kampala as ugandan capital in 1962",
  "image_path": [],
  "table": [],
  "context": "The city grew as the capital of the Buganda kingdom, from which several buildings survive, including the Kasubi Tombs (built in 1881), the Lubiri Palace, the Buganda Parliament and the Buganda Court of Justice. In 1890, British colonial administrator Frederick Lugard constructed a forum along Mengo Hill within the city, which allowed for the British to occupy much of the territory controlled by the Buganda, including Kampala. In 1894, the British government officially established a protectorate within this territory, and in 1896, the protectorate expanded to cover the Ankole, Toro Kingdom, and Bunyoro kingdoms as well. In 1905, the British government formally declared the entire territory to be a British colony. From that time until the independence of the country in 1962, the capital was relocated to Entebbe, although the city continued to be the primary economic and manufacturing location for Uganda. In 1922, the Makerere Technical Institute, now known as Makerere University, started as the first collegiate institution both within Kampala, and within the British colonies on the east coast of Africa. Following the 1962 independence, Milton Obote became president of Uganda, and held the position until 1971, when former sergeant Idi Amin defeated his government in a military coup. He proceeded to expel all Asian residents living within Kampala, and attacked the Jewish population living within the city. In 1978, he invaded the neighboring country of Tanzania, and in turn, the government there started the Uganda–Tanzania War, which created severe damage to the buildings of Kampala. Since then, the city has since then been rebuilt with constructions of new construction of hotels, banks, shopping malls, educational institutions, and hospitals and the improvement of war torn buildings and infrastructure. Traditionally, Kampala was a city of seven hills, but over time it has come to have a lot more.",
  "image_cues": "",
  "user_profile": "general"
}