{
  "question": "who killed fergus in once upon a time",
  "image_path": [],
  "table": [],
  "context": "Two years previous to the present day events, a rider arrives to the Witch's Hut from Brave, and demands to show themselves and asks for magic. The person, King Fergus, is met by a witch who asks what he wants and he says he needs something to ensure the future of his kingdom and says he will pay the price. She says he can pay her later and calls it an IOU and offers him a contract to sign and he stamps it with his signet ring. She says it’s a deal and she blends up a potion using a pluck of his hair. Later on, Fergus and Merida walking among the clans. Fergus says he’ll take the tongue of the next man who disrespects her. She sees the men writing and thinks they’re sending love notes but Fergus says they’re writing their last will and testaments. Fergus also gave Merida his prized bow that she can carry into her first battle, and Merida thanked her father for keeping her safe. Merida pulls a sword and challenges the man who knocks her down, but the person who defeated her was Mulan, who says she can teach her how to fight better than any man there and will teach her honor as well. Some of the men watching mock her and call Mulan her nursemaid, but tells her no one will follow her out of fear and says to ask her father since they already follow him. Later that day, Merida came looking for him by the water. He says the invaders are sailing in and he’s watching for them. She asks if they will win the war and then says she wants to know how he inspired all these men to follow him into battle. He looks at the helm and she asks if everything is all right. Fergus says you have to show you’re the first one willing to die and says that tells them how important it is. He tells her he’s the Bear King and can face anything. She sees her father with the helm and discovers that Mulan had kept Merida from going with him. When she arrived and sees a knight coming towards Fergus, Merida aims an arrow at the knight, but misses as the knight kills Fergus. The Knight removes his helm, who is then revealed to be Arthur.",
  "image_cues": "",
  "user_profile": "general"
}