{
  "question": "Among the top goal-scoring players on the Serbian national football team, who has lower Caps: the white-haired athlete, or the man who lived longer out of the pair of Stjepan Bobek and Ferenc Puskas?",
  "image_path": [
    "/Users/ashishrajshekhar/Desktop/CORAL LAB/ADAF/data/mmqa/final_dataset_images/5e10e5969620caa1ae9a700db06cef7c"
  ],
  "table": [],
  "context": "Ferenc Puskás (/ˈpʊʃkəs/; Hungarian: [ˈfɛrɛnt͡s ˈpuʃkaːʃ], born Ferenc Purczeld; 1 April 1927 – 17 November 2006) was a Hungarian footballer and manager, widely regarded as one of the greatest players of all time. A prolific forward, he scored 84 goals in 85 international matches for Hungary, and 514 goals in 529 matches in the Hungarian and Spanish leagues. Puskás's Hungary career is often said to be 83 goals in 84 games - the extra game and goal was from a match vs Lebanon that was played in 1956, however it was only recognised as an official game by the Hungarian FA in May 2002. He became an Olympic champion in 1952 and led his nation to the final of the 1954 World Cup where he was named the tournament's best player. He won three European Cups (1959, 1960, 1966), 10 national championships (5 Hungarian and 5 Spanish Primera División) and 8 top individual scoring honors.\n\nStjepan Bobek (3 December 1923, in Zagreb – 22 August 2010, in Belgrade) was an ethnic Croat Yugoslav football striker and later football manager. Usually a forward or attacking midfielder, Bobek was renowned for his technique, vision and goalscoring ability and is commonly regarded as one of Yugoslavia's greatest players. Ferenc Puskás once said: \"Bobek's technique with the ball is unrivaled. I'm not ashamed to admit, that I tried to copy him. How God-like that guy dribbled and his back-heel pass was impeccable. He still is one of the most noble artists in football.\"[citation needed]",
  "image_cues": "",
  "user_profile": "general"
}