{
  "question": "which party was in power in u.k. when india became independent",
  "image_path": [],
  "table": [],
  "context": "For decades the Conservatives were split on India between die-hard imperialists (led by Churchill) and moderate elements who tried to provide limited local control.  Meanwhile, the small Labour minority in Parliament was sympathetic to the Congress movement led by Mahatma Gandhi and Jawaharial Nehru. Decolonisation was never a major election issue; Labour was not officially in favour of decolonisation when it was elected in 1945. With violence escalating in India after the war, but with British financial power at a low ebb, large-scale military involvement was impossible. The Viceroy of India warned he needed a further seven army divisions to prevent communal violence if independence negotiations failed. None were available, so political restructuring was accelerated. The Labour government gave independence to India and Pakistan in an unexpectedly quick move in 1947. Historian and Conservative party sympathiser Andrew Roberts says the independence of India was a \"national humiliation\" but it was necessitated by urgent financial, administrative, strategic and political needs.  Whereas Churchill in 1940-45 had tightened the hold on India and imprisoned the Congress leadership, Labour had looked forward to making it a fully independent dominion like Canada or Australia. Many of the Congress leaders in India had studied in England, and were highly regarded as fellow idealistic socialists by Labour leaders. Attlee was the Labour expert on India and took special charge of decolonization.  Attlee found that Churchill's viceroy, Field Marshal Wavell, was too imperialistic, too keen on military solutions (he wanted seven more Army divisions) and too neglectful of Indian political alignments. The new Viceroy was Lord Mountbatten, the dashing  war hero and a cousin of the King. The boundary between the newly created states of Pakistan and India involved the widespread resettlement of millions of Muslims and Hindus (and many Sikhs). Extreme violence ensued when Punjab and Bengal provinces were split. Historian Yasmin Khan estimates that between a half-million and a million men, women and children were killed. Gandhi himself was assassinated by a Hindu activist in January 1948.",
  "image_cues": "",
  "user_profile": "general"
}