{
  "question": "What is the publishing date of this novel by Ruth Plumly Thompson, originally written in 1959, and featuring Jinnicky the Red Jinn as a principal pre-existing character?",
  "image_path": [],
  "table": [],
  "context": "Yankee in Oz is a 1972 Oz novel by Ruth Plumly Thompson.  It was the first published by The International Wizard of Oz Club.  A letter from the Henry Regnery Company, which bought Reilly & Lee, is reproduced in the front indicating the publisher's blessing for the new Oz book to appear.  It was originally written in 1959, but because the Oz books were not selling, it was not published.  The first two editions of the book were published in 8½ x 11 inch format and running only 94 pages.  This was done at the request of illustrator Dick Martin to reduce the number of required illustrations and to show them closer to the actual size they were drawn.  The second printing (1986) featured a new cover, with the first edition artwork reprinted preceding the title page.  The third printing (2007) is standard Oz book size.  Its cover is a gaudier redesign of the second edition cover.  The book also features maps by James E. Haff, and as such, Thompson correctly places the Winkie Country in the west of Oz.\n\nThe Red Jinn, later known as Jinnicky, is one of Ruth Plumly Thompson's most frequently occurring characters in her Oz books.  He was first introduced in Jack Pumpkinhead of Oz as a mysterious figure who educates Jack Pumpkinhead on the use of the Pirate Sack.  Although a detailed description is included in the text, Jack Pumpkinhead of Oz includes no illustrations of the Red Jinn aside from a gruesome color plate that did not appear outside the first edition, in which he has massive piercings.  He was reintroduced, drawn, and given the name Jinnicky in The Purple Prince of Oz; he also appeared in the follow-up, The Silver Princess in Oz.  (He makes a cameo appearance in The Wishing Horse of Oz, and he is the principal pre-existing character in Thompson's sub-canonical penultimate Oz book, Yankee in Oz).   Jack Snow apparently thought the Red Jinn was a separate character, for he considered The Purple Prince of Oz Jinnicky's first appearance in Who's Who in Oz, though he did not include a separate Red Jinn entry.",
  "image_cues": "",
  "user_profile": "general"
}